#include <avr/io.h>
#include "common.h"

/************************************************************
	UART初期化
************************************************************/
void uartInit(void)
{
	//CPU16MHz 9600bps
	UBRR0 = 103;
	//CPU16MHz 19200bps
	//UBRR0 = 51;

	//受信許可,送信許可
	UCSR0B = _BV(RXEN0) | _BV(TXEN0);

	//データ8bit,パリティ無し,ストップビット1bit
	UCSR0C = (0 << USBS0) | (3 << UCSZ00);
}

/************************************************************
	1byte受信
************************************************************/
uint8_t receive1byte(void)
{
	while (!(UCSR0A & _BV(RXC0)));

	return UDR0;
}

/************************************************************
	1byte送信
************************************************************/
void send1byte(uint8_t data)
{
	while (!(UCSR0A & _BV(UDRE0)));

	UDR0 = data;
}